from string import Template

### قوالب برومبت RAG

### برومبت النظام (System Prompt)

system_promt = Template("\n".join(
    [
    "أنت مساعد مخصص لتوليد رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك توليد الرد بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المتعلقة باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "يجب أن يكون الرد بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا ومختصرًا في ردك. تجنّب المعلومات غير الضرورية.",
    ]
))

### برومبت المستند (Document Prompt)

document_prompt = Template("\n".join([
    "## رقم المستند: $doc_num",
    "### المحتوى: $chunk_text",
]
))

### برومبت الخاتمة (Footer Prompt)

footer_prompt = Template("\n".join([
    "اعتمادًا فقط على المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
    "##السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))